import time

class Settings:
    def __init__(self):
        self.stop_time = 0.2

        # 指令集
        self.bedroom_set_list = ['help', 'finish', 'outdoor', '@myroom','@bag','@me']

        # 场景切换
        self._bedroom = True
        self._shop = True

        # 货币
        self.gold = 9999

        ################################################################
        # 魔杖

        # 魔杖用木(13种)
        self.WandDict = {
            'Alder/桤木': ['桤木最适合无声咒语的施放，'
                         '由此它也名声在外，'
                         '据说它只适合最高深的男女巫师。',
                         '15'],
            'Apple/苹果木': ['这种魔杖的主人经常被发现'
                          '拥有与其他魔法生命交谈的非凡能力',
                          '13'],
            'Ash/白蜡木': ['白蜡木的理想主人可能有一些固执，'
                        '一定很有胆量，但绝不会粗鲁自负。',
                        '12'],
            'Aspen/山杨木': ['山杨木的合适主人往往是熟练的决斗战士，'
                          '或者是命中注定如此'
                          '，因为山杨木魔杖是那些尤其尚武的魔杖之一。',
                          '14'],
            'Beech/山毛榉木': ['当达成正确的匹配时，'
                           '山毛榉木魔杖能够表现出在任何其他木材身上'
                           '很少能见到的精妙感与艺术性，'
                           '因此它有光辉的名声。',
                           '14'],
            'Blackthorn/黑刺李': ['这种木头制成的魔杖似乎'
                               '需要通过与主人一起经历危险或困难，'
                               '才能成为真正的契约伙伴。',
                               '15'],
            'Cherry/樱花木': ['这种非常罕见的魔杖木材'
                           '被用来制作拥有奇怪力量的魔杖',
                           '13'],
            'Fir/冷杉树': ['冷杉木魔杖非常适合变形术，'
                        '它们喜欢专注的，意志力强大的，'
                        '还有偶尔情况下，行为强势的主人。',
                        '13'],
            'Holly/冬青木': ['冬青木是最稀有的魔杖材质之一;'
                          ' 传统上被认为有保护属性，'
                          '它适合那些可能需要帮助克服愤怒和冲动的倾向的人。',
                          '16'],
            'Pear/梨木': ['梨木魔杖的拥有者通常都深受人们欢迎与尊敬.',
                        '12'],
            'Pine/松木': ['松木魔杖通常会选择那些被公认是孤独、有趣、'
                        '也许还带点小神秘的特立独行者为主人。',
                        '12'],
            'Poplar/白杨木': ['在小部分制作魔杖的人中流传着一个老掉牙的笑话，'
                           '即白杨木魔杖从不选择政客。',
                           '13'],
            'Vine/葡萄藤木': ['据可靠消息称，'
                          '这种魔杖可以在合适的主人进入房间入口的瞬间'
                          '施放出奇妙的魔法效果，',
                          '14']
        }
        # 魔杖用木列表
        self.magicWandList = ['Alder/桤木', 'Apple/苹果木', 'Ash/白蜡木',
                              'Aspen/山杨木', 'Beech/山毛榉木', 'Blackthorn/黑刺李',
                              'Cherry/樱花木', 'Fir/冷杉树', 'Holly/冬青木', 'Pear/梨木',
                              'Pine/松木', 'Poplar/白杨木', 'Vine/葡萄藤木']

    '''打印-方法'''
    def _println(self):
        for i in range(16):
            print('-', end='')
            # time.sleep(self.stop_time)
        print()
        time.sleep(0.1)


if __name__ == '__main__':
    settings = Settings()
    b = []
    for i in settings.WandDict:
        b.append(i)
        print(b)
